<!-- dflook/terraform-github-actions {"workspace":"fix-no-state-2","backend_type":"remote","backend":"e79446a5f7dbf9d4fe66cd7ba3d0a934c55c1ed4e6cd8b472c22bb7d38f8bc1d","plan_job_ref":"Job Test Terraform cloud #174 at https://github.com/dflook/terraform-github-actions/actions/runs/5662408202","plan_hash":"ba41447957688a32cf01eabe12bd495972e376312b5719894aeea2fcff2061a0","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/0.13__ in the __fix-no-state-2__ workspace
With var files: `tests/workflows/test-cloud/0.13/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test Terraform cloud #174](https://github.com/dflook/terraform-github-actions/actions/runs/5662408202)